тестовая.СозданиеОтчетаПоФизЛицам/src/Reports/ОтчетПоФизЛицам/ОтчетПоФизЛицам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоФизЛицам</name>
</mdclass:Report>

тестовая.СозданиеОтчетаПоФизЛицам/src/InformationRegisters/РегистрПоФизЛицам/РегистрПоФизЛицам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="582156e6-42a2-49bd-a202-0f8f0a3d8541">
  <name>РегистрПоФизЛицам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="a0a53836-7506-41ce-9469-74b31cbf072e">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e1d86646-0d36-4ed1-bb90-d24040d8cfed">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="755fbe31-eeaf-46a4-ab24-744763f8b79f">
    <name>СтажРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0b607a39-5e76-4aa5-bc6b-d406e1a8ae82">
    <name>ПериодСтажировки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
</mdclass:InformationRegister>

тестовая.СозданиеОтчетаПоФизЛицам/src/Reports/ОтчетПоФизЛицам/Forms/Форма/Module.bsl
//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПечататьОтчет(Команда)
	//@skip-check undefined-variable
	//@skip-check module-unused-local-variable
	//@skip-check unknown-method-property
	Макет = Отчеты.ОтчетПоФизЛицам.ПолучитьМакет(Макет);
	//@skip-check module-unused-local-variable
	ТабДок =  Новый ТабличныйДокумент();
	//@skip-check module-unused-local-variable
	//@skip-check unknown-method-property
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	//@skip-check module-unused-local-variable
	//@skip-check unknown-method-property
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ДанныеФизЛиц = ПолучитьДанныеФизЛиц();
	Для Каждого Данные Из ДанныеФизЛиц Цикл
		Ссылка = Данные.Регистратор;
		ФИО = Данные.ФИО;
		Должность = Данные.Должность;
		СтажРаботы = Данные.СтажРаботы;
		ПериодСтажировки = Данные.ПериодСтажировки;
		ТабДок.Вывести(ОбластьТело);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФизЛиц()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрПоФизЛицам.Регистратор,
		|	РегистрПоФизЛицам.ФИО,
		|	РегистрПоФизЛицам.Должность,
		|	РегистрПоФизЛицам.СтажРаботы,
		|	РегистрПоФизЛицам.ПериодСтажировки
		|ИЗ
		|	РегистрСведений.РегистрПоФизЛицам КАК РегистрПоФизЛицам";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции
